Repository: xcv58/MacTools
Catalog: Plugins/BatteryChargeLimit/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# error.persistence.failed
source: 无法保存电池充电设置。
ar: تعذر حفظ إعدادات شحن البطارية.
de: Die Einstellungen zum Laden der Batterie konnten nicht gesichert werden.
en: Unable to save battery charging settings.
es: No se han podido guardar los ajustes de carga de la batería.
fr: Impossible d’enregistrer les réglages de charge de la batterie.
ja: バッテリー充電設定を保存できませんでした。
ko: 배터리 충전 설정을 저장할 수 없습니다.
pt: Não foi possível salvar os ajustes de carregamento da bateria.
ru: Не удалось сохранить настройки зарядки аккумулятора.
tr: Pil şarj ayarları kaydedilemedi.
zh_hant: 無法儲存電池充電設定。

# error.persistence.rollbackFailed
source: 恢复先前设置失败。
ar: تعذرت استعادة الإعدادات السابقة.
de: Die vorherigen Einstellungen konnten nicht wiederhergestellt werden.
en: The previous settings could not be restored.
es: No se han podido restaurar los ajustes anteriores.
fr: Impossible de restaurer les réglages précédents.
ja: 以前の設定を復元できませんでした。
ko: 이전 설정을 복원할 수 없습니다.
pt: Não foi possível restaurar os ajustes anteriores.
ru: Не удалось восстановить предыдущие настройки.
tr: Önceki ayarlar geri yüklenemedi.
zh_hant: 無法還原先前設定。

# error.persistence.hardwareRollbackFailed
source: 恢复先前硬件状态失败：%@
ar: تعذرت استعادة حالة الجهاز السابقة: %@
de: Der vorherige Hardwarezustand konnte nicht wiederhergestellt werden: %@
en: The previous hardware state could not be restored: %@
es: No se ha podido restaurar el estado anterior del hardware: %@
fr: Impossible de restaurer l’état matériel précédent : %@
ja: 以前のハードウェア状態を復元できませんでした：%@
ko: 이전 하드웨어 상태를 복원할 수 없습니다: %@
pt: Não foi possível restaurar o estado anterior do hardware: %@
ru: Не удалось восстановить предыдущее состояние оборудования: %@
tr: Önceki donanım durumu geri yüklenemedi: %@
zh_hant: 無法還原先前硬件狀態：%@

# error.action.rollbackFailed
source: %@；恢复先前状态失败：%@
ar: %@؛ تعذرت استعادة الحالة السابقة: %@
de: %@; der vorherige Zustand konnte nicht wiederhergestellt werden: %@
en: %@; the previous state could not be restored: %@
es: %@; no se pudo restaurar el estado anterior: %@
fr: %@ ; impossible de restaurer l’état précédent : %@
ja: %@。以前の状態を復元できませんでした：%@
ko: %@. 이전 상태를 복원하지 못했습니다: %@
pt: %@; não foi possível restaurar o estado anterior: %@
ru: %@; не удалось восстановить предыдущее состояние: %@
tr: %@; önceki durum geri yüklenemedi: %@
zh_hant: %@；無法還原先前狀態：%@

# error.helperInstall.authorizationScriptUnavailable
source: 无法创建授权脚本
ar: غير قادر على إنشاء البرنامج النصي للتفويض.
de: Das Autorisierungsskript konnte nicht erstellt werden.
en: Unable to create the authorization script.
es: No se puede crear el script de autorización.
fr: Impossible de créer le script d'autorisation.
ja: 認可スクリプトを作成できません。
ko: 인증 스크립트를 생성할 수 없습니다.
pt: Não foi possível criar o script de autorização.
ru: Невозможно создать скрипт авторизации.
tr: Yetkilendirme betiği oluşturulamadı.
zh_hant: 無法創建授權腳本

# error.helperInstall.missingAfterInstall
source: 安装后仍无法找到组件
ar: لا يزال يتعذر العثور على المكون بعد التثبيت.
de: Die Komponente kann nach der Installation immer noch nicht gefunden werden.
en: The component still cannot be found after installation.
es: Aún no se puede encontrar el componente después de la instalación.
fr: Le composant est toujours introuvable après l'installation.
ja: インストール後もコンポーネントが見つかりません。
ko: 설치 후에도 구성 요소를 찾을 수 없습니다.
pt: O componente ainda não foi encontrado após a instalação.
ru: Компонент по-прежнему не найден после установки.
tr: Bileşen yüklemeden sonra da bulunamadı.
zh_hant: 安裝後仍無法找到組件

# error.helperInstallFailed
source: 安装电池控制组件失败：%@
ar: فشل تثبيت مكون التحكم في البطارية: %@
de: Batteriesteuerungskomponente konnte nicht installiert werden: %@
en: Failed to install battery control component: %@
es: Error al instalar el componente de control de batería: %@
fr: Échec de l'installation du composant de contrôle de la batterie : %@
ja: バッテリー制御コンポーネントのインストールに失敗しました: %@
ko: 배터리 제어 구성요소 설치 실패: %@
pt: Falha ao instalar o componente de controle da bateria: %@
ru: Не удалось установить компонент управления аккумулятором: %@
tr: Pil denetim bileşeni yüklenemedi: %@
zh_hant: 安裝電池控制組件失敗：%@

# error.helperNotFound
source: 未找到内置电池控制组件。请重新安装电池充电上限插件。
ar: لم يتم العثور على مكون التحكم في البطارية المجمع. أعد تثبيت المكوّن الإضافي Battery Charge Limit.
de: Die mitgelieferte Batteriesteuerungskomponente wurde nicht gefunden. Installieren Sie das Plugin „Battery Charge Limit“ neu.
en: The bundled battery control component was not found. Reinstall the Battery Charge Limit plugin.
es: No se encontró el componente de control de batería incluido. Vuelva a instalar el complemento Límite de carga de la batería.
fr: Le composant de contrôle de batterie fourni est introuvable. Réinstallez le plug-in Battery Charge Limit.
ja: バンドルされているバッテリー制御コンポーネントが見つかりませんでした。 Battery Charge Limit プラグインを再インストールします。
ko: 번들 배터리 제어 구성 요소를 찾을 수 없습니다. 배터리 충전 제한 플러그인을 다시 설치하세요.
pt: O componente de controle da bateria incluído não foi encontrado. Reinstale o plug-in Battery Charge Limit.
ru: Входящий в комплект поставки компонент управления аккумулятором не найден. Переустановите плагин ограничения заряда батареи.
tr: Uygulamayla gelen pil denetim bileşeni bulunamadı. Pil Şarj Sınırı eklentisini yeniden yükleyin.
zh_hant: 未找到內置電池控制組件。請重新安裝電池充電上限外掛。

# error.helperVerificationFailed
source: 电池控制组件校验失败。请重新安装电池充电上限插件。
ar: فشل التحقق من مكون التحكم في البطارية. أعد تثبيت المكوّن الإضافي Battery Charge Limit.
de: Überprüfung der Batteriesteuerungskomponente fehlgeschlagen. Installieren Sie das Plugin „Battery Charge Limit“ neu.
en: Battery control component verification failed. Reinstall the Battery Charge Limit plugin.
es: Error en la verificación del componente de control de la batería. Vuelva a instalar el complemento Límite de carga de la batería.
fr: La vérification des composants de contrôle de la batterie a échoué. Réinstallez le plug-in Battery Charge Limit.
ja: バッテリー制御コンポーネントの検証に失敗しました。 Battery Charge Limit プラグインを再インストールします。
ko: 배터리 제어 구성 요소 확인에 실패했습니다. 배터리 충전 제한 플러그인을 다시 설치하세요.
pt: Falha na verificação do componente de controle da bateria. Reinstale o plug-in Battery Charge Limit.
ru: Проверка компонента управления аккумулятором не удалась. Переустановите плагин ограничения заряда батареи.
tr: Pil denetim bileşeni doğrulanamadı. Pil Şarj Sınırı eklentisini yeniden yükleyin.
zh_hant: 電池控制組件校驗失敗。請重新安裝電池充電上限外掛。

# error.noSupportedSMCKey
source: 当前 Mac 固件未提供可写的充电控制键。可能是 macOS 已升级到不支持的版本。
ar: لا يعرض برنامج Mac الثابت هذا مفتاحًا للتحكم في الشحن قابلاً للكتابة. ربما قام نظام التشغيل macOS بتغيير الدعم في هذا الإصدار.
de: Diese Mac-Firmware stellt keinen beschreibbaren Ladekontrollschlüssel zur Verfügung. Möglicherweise hat macOS in dieser Version die Unterstützung geändert.
en: This Mac firmware does not expose a writable charge control key. macOS may have changed support in this version.
es: Este firmware de Mac no expone una clave de control de carga grabable. Es posible que macOS haya cambiado la compatibilidad en esta versión.
fr: Ce micrologiciel Mac n'expose pas de clé de contrôle de charge inscriptible. macOS a peut-être changé de prise en charge dans cette version.
ja: この Mac ファームウェアは書き込み可能な充電制御キーを公開しません。 macOS は、このバージョンでのサポートが変更されている可能性があります。
ko: 이 Mac 펌웨어는 쓰기 가능한 충전 제어 키를 노출하지 않습니다. macOS가 이 버전에서 지원을 변경했을 수 있습니다.
pt: Este firmware Mac não expõe uma chave de controle de carga gravável. O macOS pode ter alterado o suporte nesta versão.
ru: Эта прошивка Mac не предоставляет записываемый ключ управления зарядом. Поддержка macOS в этой версии могла быть изменена.
tr: Bu Mac'in ürün yazılımı, yazılabilir bir şarj denetim anahtarı sunmuyor. macOS bu sürümde desteği değiştirmiş olabilir.
zh_hant: 當前 Mac 固件未提供可寫的充電控制鍵。可能是 macOS 已升級到不支持的版本。

# error.write.inhibitCharging
source: 无法停止充电
ar: غير قادر على إيقاف الشحن
de: Ladevorgang konnte nicht gestoppt werden
en: Unable to stop charging
es: No se puede detener la carga
fr: Impossible d'arrêter la charge
ja: 充電を停止できません
ko: 충전을 중지할 수 없습니다
pt: Não é possível interromper o carregamento
ru: Невозможно остановить зарядку
tr: Şarj durdurulamadı
zh_hant: 無法停止充電

# error.write.resumeCharging
source: 无法恢复充电
ar: غير قادر على استئناف الشحن
de: Ladevorgang kann nicht fortgesetzt werden
en: Unable to resume charging
es: No se puede reanudar la carga
fr: Impossible de reprendre le chargement
ja: 充電を再開できません
ko: 충전을 재개할 수 없습니다
pt: Não é possível retomar o carregamento
ru: Невозможно возобновить зарядку
tr: Şarj devam ettirilemedi
zh_hant: 無法恢復充電

# error.write.toggleDischarge
source: 无法切换放电模式
ar: غير قادر على تبديل وضع التفريغ
de: Entlademodus kann nicht umgeschaltet werden
en: Unable to switch discharge mode
es: No se puede cambiar el modo de descarga
fr: Impossible de changer de mode de décharge
ja: 放電モードを切り替えられません
ko: 방전 모드를 전환할 수 없습니다
pt: Não é possível alternar o modo de descarga
ru: Невозможно переключить режим разрядки
tr: Deşarj modu değiştirilemedi
zh_hant: 無法切換放電模式

# error.writeFailed
source: 写入充电控制失败：%@
ar: فشلت كتابة حالة التحكم في البطارية: %@
de: Batteriekontrollstatus konnte nicht geschrieben werden: %@
en: Failed to write battery control state: %@
es: Error al escribir el estado de control de la batería: %@
fr: Échec de l'écriture de l'état de contrôle de la batterie : %@
ja: バッテリー制御状態の書き込みに失敗しました: %@
ko: 배터리 제어 상태를 쓰지 못했습니다: %@
pt: Falha ao gravar o estado de controle da bateria: %@
ru: Не удалось записать состояние управления батареей: %@
tr: Pil denetim durumu yazılamadı: %@
zh_hant: 寫入充電控制失敗：%@

# metadata.description
source: 限制电池充电至指定上限
ar: الحد من شحن البطارية إلى المستوى المختار.
de: Begrenzen Sie die Akkuladung auf ein ausgewähltes Niveau.
en: Limit battery charging to a chosen level.
es: Limite la carga de la batería a un nivel elegido.
fr: Limiter la charge de la batterie à un niveau choisi.
ja: バッテリーの充電を選択したレベルに制限します。
ko: 배터리 충전을 선택한 수준으로 제한하세요.
pt: Limite o carregamento da bateria a um nível escolhido.
ru: Ограничить зарядку аккумулятора до выбранного уровня.
tr: Pil şarjını seçilen düzeye kadar sınırlayın.
zh_hant: 限制電池充電至指定上限

# metadata.title
source: 电池充电上限
ar: حد شحن البطارية
de: Akkuladegrenze
en: Battery Charge Limit
es: Límite de carga de la batería
fr: Limite de charge de la batterie
ja: バッテリー充電制限
ko: 배터리 충전 제한
pt: Limite de carga da bateria
ru: Предел заряда аккумулятора
tr: Pil Şarj Sınırı
zh_hant: 電池充電上限

# panel.action.disable
source: 停用充电上限
ar: تعطيل حد الرسوم
de: Ladelimit deaktivieren
en: Disable Charge Limit
es: Desactivar límite de cargos
fr: Désactiver la limite de charge
ja: 充電制限を無効にする
ko: 충전 한도 비활성화
pt: Desativar limite de cobrança
ru: Отключить ограничение заряда
tr: Şarj Sınırını Devre Dışı Bırak
zh_hant: 停用充電上限

# panel.action.dischargeToLimit
source: 强制放电至 %d%%
ar: التفريغ إلى %d%%
de: Entlassung an %d%%
en: Discharge to %d%%
es: Descarga a %d%%
fr: Déchargement à %d%%
ja: %d%% まで放電
ko: %d%%로 하차
pt: Descarga para %d%%
ru: Выписка в %d%%
tr: %d%% Düzeyine Deşarj Et
zh_hant: 強制放電至 %d%%

# panel.action.enable
source: 启用充电上限
ar: تمكين حد الرسوم
de: Ladelimit aktivieren
en: Enable Charge Limit
es: Habilitar límite de cargos
fr: Activer la limite de charge
ja: 充電制限を有効にする
ko: 충전 한도 활성화
pt: Ativar limite de cobrança
ru: Включить лимит заряда
tr: Şarj Sınırını Etkinleştir
zh_hant: 啟用充電上限

# panel.action.missingHelper
source: 电池控制组件缺失
ar: مكون التحكم في البطارية مفقود
de: Batteriesteuerungskomponente fehlt
en: Battery control component missing
es: Falta el componente de control de batería
fr: Composant de contrôle de la batterie manquant
ja: バッテリー制御コンポーネントがありません
ko: 배터리 제어 구성요소 누락
pt: Componente de controle da bateria ausente
ru: Отсутствует компонент управления аккумулятором
tr: Pil denetim bileşeni eksik
zh_hant: 電池控制組件缺失

# panel.action.settings
source: 设置…
ar: الإعدادات...
de: Einstellungen…
en: Settings…
es: Configuración…
fr: Paramètres…
ja: 設定…
ko: 설정…
pt: Configurações…
ru: Настройки…
tr: Ayarlar…
zh_hant: 設定…

# panel.action.startCharging
source: 开始充电
ar: ابدأ الشحن
de: Ladevorgang starten
en: Start Charging
es: Comenzar a cargar
fr: Commencer à charger
ja: 充電を開始
ko: 충전 시작
pt: Começar a carregar
ru: Начать зарядку
tr: Şarjı Başlat
zh_hant: 開始充電

# panel.action.stopCharging
source: 停止充电
ar: أوقف الشحن
de: Aufladen beenden
en: Stop Charging
es: Dejar de cargar
fr: Arrêter de charger
ja: 充電を停止
ko: 충전 중지
pt: Parar de carregar
ru: Остановить зарядку
tr: Şarjı Durdur
zh_hant: 停止充電

# panel.action.stopDischarging
source: 停止放电
ar: إيقاف التفريغ
de: Entladen stoppen
en: Stop Discharging
es: Detener la descarga
fr: Arrêter la décharge
ja: 放電を停止
ko: 방전 중지
pt: Parar de descarregar
ru: Остановить разрядку
tr: Deşarjı Durdur
zh_hant: 停止放電

# panel.section.limit
source: 充电上限
ar: حد الشحن
de: Gebührenlimit
en: Charge Limit
es: Límite de cargo
fr: Limite de frais
ja: チャージ制限
ko: 충전 한도
pt: Limite de cobrança
ru: Лимит заряда
tr: Şarj Sınırı
zh_hant: 充電上限

# panel.subtitle.charging
source: 充电中 · %d%% → %d%%
ar: الشحن · %d%% → %d%%
de: Aufladen · %d%% → %d%%
en: Charging · %d%% → %d%%
es: Cargando · %d%% → %d%%
fr: Charge · %d%% → %d%%
ja: 充電中 · %d%% → %d%%
ko: 충전 중 · %d%% → %d%%
pt: Carregando · %d%% → %d%%
ru: Зарядка · %d%% → %d%%
tr: Şarj ediliyor · %d%% → %d%%
zh_hant: 充電中 · %d%% → %d%%

# panel.subtitle.chargingStopped
source: 已停止充电 · %d%% / %d%%
ar: توقف الشحن · %d%% / %d%%
de: Ladevorgang gestoppt · %d%% / %d%%
en: Charging stopped · %d%% / %d%%
es: Carga detenida · %d%% / %d%%
fr: Charge arrêtée · %d%% / %d%%
ja: 充電が停止しました · %d%% / %d%%
ko: 충전 중지됨 · %d%% / %d%%
pt: Carregamento interrompido · %d%% / %d%%
ru: Зарядка остановлена · %d%% / %d%%
tr: Şarj durduruldu · %d%% / %d%%
zh_hant: 已停止充電 · %d%% / %d%%

# panel.subtitle.disabled
source: 未启用 · %d%%
ar: إيقاف · %d%%
de: Aus · %d%%
en: Off · %d%%
es: Desactivado · %d%%
fr: Désactivé · %d%%
ja: オフ · %d%%
ko: 끄기 · %d%%
pt: Desligado · %d%%
ru: Выкл. · %d%%
tr: Kapalı · %d%%
zh_hant: 未啟用 · %d%%

# panel.subtitle.discharging
source: 放电中 · %d%% → %d%%
ar: التفريغ · %d%% → %d%%
de: Entladen · %d%% → %d%%
en: Discharging · %d%% → %d%%
es: Descarga · %d%% → %d%%
fr: Décharge · %d%% → %d%%
ja: 放電中 · %d%% → %d%%
ko: 방전 · %d%% → %d%%
pt: Descarregando · %d%% → %d%%
ru: Разрядка · %d%% → %d%%
tr: Deşarj ediliyor · %d%% → %d%%
zh_hant: 放電中 · %d%% → %d%%

# panel.subtitle.limitReached
source: 已达上限 · %d%% / %d%%
ar: تم الوصول إلى الحد · %d%% / %d%%
de: Limit erreicht · %d%% / %d%%
en: Limit reached · %d%% / %d%%
es: Límite alcanzado · %d%% / %d%%
fr: Limite atteinte · %d%% / %d%%
ja: 制限に達しました · %d%% / %d%%
ko: 한도 도달 · %d%% / %d%%
pt: Limite atingido · %d%% / %d%%
ru: Достигнут лимит · %d%% / %d%%
tr: Sınıra ulaşıldı · %d%% / %d%%
zh_hant: 已達上限 · %d%% / %d%%

# panel.subtitle.noBattery
source: 未检测到电池
ar: لم يتم اكتشاف أي بطارية
de: Kein Akku erkannt
en: No battery detected
es: No se detectó batería
fr: Aucune batterie détectée
ja: バッテリーが検出されません
ko: 배터리가 감지되지 않음
pt: Nenhuma bateria detectada
ru: Батарея не обнаружена
tr: Pil algılanmadı
zh_hant: 未檢測到電池

# settings.status.enabled
source: 默认行为
ar: السلوك الافتراضي
de: Standardverhalten
en: Default Behavior
es: Comportamiento predeterminado
fr: Comportement par défaut
ja: デフォルト動作
ko: 기본 동작
pt: Comportamento padrão
ru: Поведение по умолчанию
tr: Varsayılan Davranış
zh_hant: 預設行為

# settings.status.limited
source: 有限支持
ar: دعم محدود
de: Eingeschränkte Unterstützung
en: Limited Support
es: Compatibilidad limitada
fr: Prise en charge limitée
ja: 一部対応
ko: 제한적 지원
pt: Suporte limitado
ru: Ограниченная поддержка
tr: Sınırlı Destek
zh_hant: 有限支援

# settings.behavior.noAutoResume.description
source: 电量低于上限时不会自动充电，需要在菜单栏点击「开始充电」才会继续。这与系统自带的「优化电池充电」不同——系统会持续微充电以贴近上限。
ar: عندما تنخفض طاقة البطارية إلى ما دون الحد المسموح به، لن يتم استئناف الشحن تلقائيًا. انقر فوق "بدء الشحن" في شريط القائمة عندما تريد المتابعة. وهذا يختلف عن شحن البطارية المحسّن لنظام التشغيل macOS، والذي يحافظ على الشحن المتتابع بالقرب من الحد الأقصى.
de: Wenn der Akku unter den Grenzwert fällt, wird der Ladevorgang nicht automatisch fortgesetzt. Klicken Sie in der Menüleiste auf „Aufladen starten“, wenn Sie fortfahren möchten. Dies unterscheidet sich von macOS Optimized Battery Charging, das die Erhaltungsladung nahe am Limit hält.
en: When the battery drops below the limit, charging will not resume automatically. Click "Start Charging" in the menu bar when you want to continue. This differs from macOS Optimized Battery Charging, which keeps trickle charging near the limit.
es: Cuando la batería cae por debajo del límite, la carga no se reanudará automáticamente. Haga clic en "Comenzar a cargar" en la barra de menú cuando desee continuar. Esto difiere de la carga de batería optimizada de macOS, que mantiene la carga lenta cerca del límite.
fr: Lorsque la batterie descend en dessous de la limite, la charge ne reprend pas automatiquement. Cliquez sur « Démarrer le chargement » dans la barre de menu lorsque vous souhaitez continuer. Cela diffère du chargement optimisé de la batterie macOS, qui maintient la charge de maintien proche de la limite.
ja: バッテリー残量が制限値を下回った場合、充電は自動的に再開されません。続行する場合は、メニューバーの「充電開始」をクリックしてください。これは、トリクル充電を限界近くに保つ macOS の最適化されたバッテリー充電とは異なります。
ko: 배터리가 한도 이하로 떨어지면 충전이 자동으로 재개되지 않습니다. 계속하려면 메뉴 표시줄에서 "충전 시작"을 클릭하세요. 이는 한계에 가깝게 세류 충전을 유지하는 macOS 최적화 배터리 충전과 다릅니다.
pt: Quando a bateria cair abaixo do limite, o carregamento não será retomado automaticamente. Clique em “Iniciar carregamento” na barra de menu quando quiser continuar. Isso é diferente do carregamento otimizado da bateria do macOS, que mantém o carregamento lento próximo ao limite.
ru: Когда уровень заряда батареи упадет ниже предела, зарядка не возобновится автоматически. Нажмите «Начать зарядку» в строке меню, если хотите продолжить. Это отличается от оптимизированной зарядки аккумулятора macOS, которая поддерживает подзарядку на пределе.
tr: Pil düzeyi sınırın altına düştüğünde şarj otomatik olarak devam etmez. Devam etmek istediğinizde menü çubuğundan “Şarjı Başlat” seçeneğini tıklayın. Bu davranış, sınırın yakınında mikro şarja devam eden macOS'un Optimize Edilmiş Pil Şarjı özelliğinden farklıdır.
zh_hant: 電量低於上限時不會自動充電，需要在選單列點擊「開始充電」纔會繼續。這與系統自帶的「優化電池充電」不同——系統會持續微充電以貼近上限。

# settings.behavior.noAutoResume.title
source: 不自动恢复充电
ar: عدم الاستئناف تلقائيًا
de: Nicht automatisch fortsetzen
en: Do Not Resume Automatically
es: No reanudar automáticamente
fr: Ne pas reprendre automatiquement
ja: 自動的に再開しない
ko: 자동으로 재개하지 않음
pt: Não retomar automaticamente
ru: Не возобновлять автоматически
tr: Otomatik Devam Etme
zh_hant: 不自動恢復充電

# settings.behavior.title
source: 充电行为
ar: سلوك الشحن
de: Ladeverhalten
en: Charging Behavior
es: Comportamiento de carga
fr: Comportement de charge
ja: 充電動作
ko: 충전 동작
pt: Comportamento de carregamento
ru: Поведение зарядки
tr: Şarj Davranışı
zh_hant: 充電行為

# settings.compatibility.controlMethod
source: 充电控制方式
ar: طريقة التحكم في الشحن
de: Ladekontrollmethode
en: Charge Control Method
es: Método de control de carga
fr: Méthode de contrôle des frais
ja: 充電制御方法
ko: 충전 제어 방법
pt: Método de controle de cobrança
ru: Метод контроля заряда
tr: Şarj Denetim Yöntemi
zh_hant: 充電控制方式

# settings.compatibility.forceDischarge
source: 强制放电
ar: تفريغ القوة
de: Erzwungene Entladung
en: Force Discharge
es: Descarga de fuerza
fr: Décharge forcée
ja: 強制排出
ko: 강제 방출
pt: Descarga Forçada
ru: Принудительный разряд
tr: Zorla Deşarj
zh_hant: 強制放電

# settings.compatibility.forceDischarge.supported
source: 支持（SMC）
ar: مدعوم (SMC)
de: Unterstützt (SMC)
en: Supported (SMC)
es: Compatible (SMC)
fr: Supporté (SMC)
ja: サポート (SMC)
ko: 지원됨(SMC)
pt: Compatível (SMC)
ru: Поддерживается (SMC)
tr: Destekleniyor (SMC)

# settings.compatibility.intelLimit.description
source: 当前 Mac 仅支持 BCLM，电量低于上限时仍可能被系统自动充至上限。「不自动恢复」语义在 Intel Mac 上无法保证。
ar: يدعم جهاز Mac هذا BCLM فقط. عندما تنخفض البطارية إلى ما دون الحد المسموح به، قد يستمر النظام في إعادة شحنها إلى الحد المسموح به. لا يمكن ضمان سلوك "عدم الاستئناف تلقائيًا" على أجهزة Intel Mac.
de: Dieser Mac unterstützt nur BCLM. Wenn der Akku unter den Grenzwert fällt, kann das System ihn möglicherweise trotzdem bis zum Grenzwert aufladen. Das Verhalten „Nicht automatisch fortsetzen“ kann auf Intel-Macs nicht garantiert werden.
en: This Mac only supports BCLM. When the battery drops below the limit, the system may still charge it back to the limit. The "do not resume automatically" behavior cannot be guaranteed on Intel Macs.
es: Esta Mac solo es compatible con BCLM. Cuando la batería cae por debajo del límite, el sistema aún puede cargarla nuevamente hasta el límite. El comportamiento "no reanudar automáticamente" no se puede garantizar en Mac Intel.
fr: Ce Mac prend uniquement en charge BCLM. Lorsque la batterie descend en dessous de la limite, le système peut toujours la recharger jusqu'à la limite. Le comportement « ne pas reprendre automatiquement » ne peut pas être garanti sur les Mac Intel.
ja: この Mac は BCLM のみをサポートしています。バッテリーが制限値を下回った場合でも、システムはバッテリーを制限値まで充電し直すことがあります。 「自動的に再開しない」動作は、Intel Mac では保証できません。
ko: 이 Mac은 BCLM만 지원합니다. 배터리가 한도 아래로 떨어지더라도 시스템은 배터리를 한도까지 다시 충전할 수 있습니다. Intel Mac에서는 "자동으로 다시 시작하지 않음" 동작이 보장되지 않습니다.
pt: Este Mac suporta apenas BCLM. Quando a bateria cai abaixo do limite, o sistema ainda pode carregá-la até o limite. O comportamento "não retomar automaticamente" não pode ser garantido em Macs Intel.
ru: Этот Mac поддерживает только BCLM. Когда уровень заряда батареи опускается ниже предела, система все равно может зарядить ее до предела. Поведение «не возобновлять автоматически» не может быть гарантировано на компьютерах Intel Mac.
tr: Bu Mac yalnızca BCLM destekler. Pil düzeyi sınırın altına düştüğünde sistem yine de pili sınıra kadar şarj edebilir. “Otomatik devam etme” davranışı Intel Mac'lerde garanti edilemez.
zh_hant: 當前 Mac 僅支持 BCLM，電量低於上限時仍可能被系統自動充至上限。「不自動恢復」語義在 Intel Mac 上無法保證。

# settings.compatibility.intelLimit.title
source: Intel Mac 限制
ar: حدود Intel Mac
de: Intel Mac-Einschränkung
en: Intel Mac Limitation
es: Limitación de Intel Mac
fr: Limitation Intel Mac
ja: Intel Mac の制限
ko: Intel Mac 제한
pt: Limitação do Intel Mac
ru: Ограничение Intel Mac
tr: Intel Mac Sınırlaması

# settings.compatibility.noSMCKey
source: 未检测到可用的 SMC 充电控制键
ar: لم يتم اكتشاف مفتاح التحكم في الشحن SMC المتاح
de: Kein verfügbarer SMC-Ladekontrollschlüssel erkannt
en: No available SMC charge control key detected
es: No se detectó ninguna clave de control de carga SMC disponible
fr: Aucune clé de contrôle de charge SMC disponible détectée
ja: 利用可能な SMC 充電制御キーが検出されませんでした
ko: 사용 가능한 SMC 충전 제어 키가 감지되지 않았습니다.
pt: Nenhuma chave de controle de carga SMC disponível foi detectada
ru: Не обнаружен доступный ключ управления зарядкой SMC
tr: Kullanılabilir SMC şarj denetim anahtarı algılanmadı
zh_hant: 未檢測到可用的 SMC 充電控制鍵

# settings.compatibility.title
source: 硬件兼容
ar: توافق الأجهزة
de: Hardwarekompatibilität
en: Hardware Compatibility
es: Compatibilidad de hardware
fr: Compatibilité matérielle
ja: ハードウェアの互換性
ko: 하드웨어 호환성
pt: Compatibilidade de hardware
ru: Аппаратная совместимость
tr: Donanım Uyumluluğu

# settings.limit.description
source: 达到此电量后自动停止充电。
ar: يتوقف الشحن تلقائيًا عند هذا المستوى.
de: Der Ladevorgang stoppt automatisch auf diesem Niveau.
en: Charging stops automatically at this level.
es: La carga se detiene automáticamente en este nivel.
fr: La charge s'arrête automatiquement à ce niveau.
ja: このレベルになると充電は自動的に停止します。
ko: 이 수준에서는 충전이 자동으로 중지됩니다.
pt: O carregamento para automaticamente neste nível.
ru: На этом уровне зарядка автоматически прекращается.
tr: Şarj, bu düzeyde otomatik olarak durur.
zh_hant: 達到此電量後自動停止充電。

# settings.limit.target
source: 目标电量
ar: المستوى المستهدف
de: Zielebene
en: Target Level
es: Nivel objetivo
fr: Niveau cible
ja: ターゲットレベル
ko: 목표 수준
pt: Nível alvo
ru: Целевой уровень
tr: Hedef Düzey
zh_hant: 目標電量

# settings.limit.title
source: 充电上限
ar: حد الشحن
de: Gebührenlimit
en: Charge Limit
es: Límite de cargo
fr: Limite de frais
ja: チャージ制限
ko: 충전 한도
pt: Limite de cobrança
ru: Лимит заряда
tr: Şarj Sınırı
zh_hant: 充電上限
